PlasmaExpansion/OpenFOAM-3.0.0/100PaOutlet/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{ 
    INLET
    {
        type            pressureInletUniformVelocity;
        value           uniform (0 0 0);
    }
    OUTLET
    {
         type            zeroGradient;
    }
    DEPOSITOR
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    WALL
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    NWALL
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    axi_symm-r
    {
        type            wedge;
    }
    axi_symm-f
    {
        type            wedge;
    }
    defaultFaces
    {
        type            empty;
    }
}
// ************************************************************************* //
