PlasmaExpansion/OpenFOAM-3.0.0/100PaOutlet/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    INLET
    {
        type            calculated;
        value           uniform 0;
    }
    OUTLET
    {
        type            calculated;
        value           uniform 0;
    }
    WALL
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    NWALL
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    DEPOSITOR
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    axi_symm-r
    {
        type            wedge;
    }
    axi_symm-f
    {
        type            wedge;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
