PlasmaExpansion/OpenFOAM-3.0.0/100PaOutlet/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            hePsiThermo;
    mixture         pureMixture;
    transport       powerLaw;
    thermo          hPolynomial;
    equationOfState perfectGas;
    specie          specie;
    energy          sensibleEnthalpy;
}

mixture
{
    specie
    {
        nMoles          1;
        molWeight       39.948002;
    }
    thermodynamics
    {
        //Cp              520.64001;
        CpCoeffs<8>     (551.74 -0.059 3.0e-5 -3.0e-9 -4.0e-13 6.0e-17 0 0);
        Hf              2.544e+6;
        Sf              0;
    }
    transport
    {
        mu0  2.125e-5;
        T0   273.15;
        k    0.72;
        Pr   0.73;
    }
}


// ************************************************************************* //
