PlasmaExpansion/OpenFOAM-3.0.0/100PaOutlet/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.000001;

vertices        
(
    (0 0 0)           						//0
//    (0	87.238777160645		1998.0964355469)  		//1
//    (0	-87.238777160645	1998.0964355469)		//2
//    (0	174.477554321		3996.19287109)  		//1
//    (0	-174.477554321		3996.19287109)		//2
    (0	88.1111649323		2018.0773999)  		//1
    (0	-88.1111649323	        2018.0773999)		//2
    (10000	0			0)			//3
    (10000	87.238777160645		1998.0964355469)	//4
    (10000	-87.238777160645	1998.0964355469)	//5
    (360000	0			0) 			//6
    (360000	87.238777160645		1998.0964355469)	//7
    (360000	-87.238777160645	1998.0964355469)	//8
    (10000	2180.9692382812		49952.41015625)  	//9
    (10000	-2180.9692382812	49952.41015625)  	//10
    (360000	2180.9692382812		49952.41015625)  	//11
    (360000	-2180.9692382812	49952.41015625)		//12
    (10000	7077.2456054688		162095.578125)		//13
    (10000	-7077.2456054688	162095.578125)		//14
    (360000	7077.2456054688		162095.578125)		//15
    (360000	-7077.2456054688	162095.578125)		//16
    (610000	2180.9692382812		49952.41015625)		//17
    (610000	-2180.9692382812	49952.41015625)		//18
    (610000	7077.2456054688		162095.578125)		//19
    (610000	-7077.2456054688	162095.578125)		//20
    (630000	2180.9692382812		49952.41015625)		//21
    (630000	-2180.9692382812	49952.41015625)		//22
    (630000	7077.2456054688		162095.578125)		//23
    (630000	-7077.2456054688	162095.578125)		//24
    (810000	2180.9692382812		49952.41015625)		//25
    (810000	-2180.9692382812	49952.41015625)		//26
    (810000	7077.2456054688		162095.578125)		//27
    (810000	-7077.2456054688	162095.578125)		//28
    (10000	-1134.1040039062	25975.25390625)		//29
    (10000	1134.1040039062		25975.25390625)		//30
    (360000	1134.1040039062		25975.25390625)		//31
    (360000	-1134.1040039062	25975.25390625)		//32
    (10000	-4629.107421875		106023.9921875)		//33
    (10000	4629.107421875		106023.9921875)		//34
    (360000	4629.107421875		106023.9921875)		//35
    (360000	-4629.107421875		106023.9921875)		//36
    (610000	4629.107421875		106023.9921875)		//37
    (610000	-4629.107421875		106023.9921875)		//38
    (630000	4629.107421875		106023.9921875)		//39
    (630000	-4629.107421875		106023.9921875)		//40
    (810000	4629.107421875		106023.9921875)		//41
    (810000	-4629.107421875		106023.9921875)		//42
    (243333.33	0			0) 			//43
    (243333.33	87.238777160645		1998.0964355469)	//44
    (243333.33	-87.238777160645	1998.0964355469)	//45
    (243333.33	1134.1040039062		25975.25390625)		//46
    (243333.33	-1134.1040039062	25975.25390625)		//47
    (243333.33	2180.9692382812		49952.41015625)  	//48
    (243333.33	-2180.9692382812	49952.41015625)  	//49
    (243333.33	4629.107421875		106023.9921875)		//50
    (243333.33	-4629.107421875		106023.9921875)		//51
    (243333.33	7077.2456054688		162095.578125)		//52
    (243333.33	-7077.2456054688	162095.578125)		//53
    (526666.6875	2180.9692382812		49952.41015625)		//54
    (526666.6875	-2180.9692382812	49952.41015625)		//55
    (526666.6875	4629.107421875		106023.9921875)		//56
    (526666.6875	-4629.107421875		106023.9921875)		//57
    (526666.6875	7077.2456054688		162095.578125)		//58
    (526666.6875	-7077.2456054688	162095.578125)		//59
    (720000	2180.9692382812		49952.41015625)		//60
    (720000	-2180.9692382812	49952.41015625)		//61
    (720000	4629.107421875		106023.9921875)		//62
    (720000	-4629.107421875		106023.9921875)		//63
    (720000	7077.2456054688		162095.578125)		//64
    (720000	-7077.2456054688	162095.578125)		//65
    (126666.66	0			0) 			//66
    (126666.66	87.238777160645		1998.0964355469)	//67
    (126666.66	-87.238777160645	1998.0964355469)	//68
    (126666.66	1134.1040039062		25975.25390625)		//69
    (126666.66	-1134.1040039062	25975.25390625)		//70
    (126666.66	2180.9692382812		49952.41015625)  	//71
    (126666.66	-2180.9692382812	49952.41015625)  	//72
    (126666.66	4629.107421875		106023.9921875)		//73
    (126666.66	-4629.107421875		106023.9921875)		//74
    (126666.66	7077.2456054688		162095.578125)		//75
    (126666.66	-7077.2456054688	162095.578125)		//76

    (443333.34375	2180.9692382812		49952.41015625)		//77
    (443333.34375	-2180.9692382812	49952.41015625)		//78
    (443333.34375	4629.107421875		106023.9921875)		//79
    (443333.34375	-4629.107421875		106023.9921875)		//80
    (443333.34375	7077.2456054688		162095.578125)		//81
    (443333.34375	-7077.2456054688	162095.578125)		//82

);

blocks          
(
    hex (0 3 3 0 2 5 4 1) (69 1 15) simpleGrading (1 1 1)				//a	
    hex (3  66 66 3  5  68 67 4) (199 1 15) simpleGrading (10.03846 1 1)		//blaa
    hex (66 43 43 66 68 45 44 67) (79 1 15) simpleGrading (1 1 1)			//blbb

    hex (43 6 6 43 45 8 7 44) (129 1 15) simpleGrading (0.3330513 1 1)			//br	

    hex (5  68 67  4 29 70 69 30) (199 1 60) simpleGrading (10.03846 1 6.138258741)	//c1laa
    hex (68 45 44 67 70 47 46 69) (79 1 60) simpleGrading (1 1 6.138258741)		//c1lbb

    hex (29 70 69 30 10 72 71 9) (199 1 37) simpleGrading (10.03846 1 0.616522811)	//c2laa
    hex (70 47 46 69 72 49 48 71) (79 1 37) simpleGrading (1 1 0.616522811)		//c2lbb

    hex (45 8 7 44 47 32 31 46) (129 1 60) simpleGrading (0.3330513 1 6.138258741)	//c1r

    hex (47 32 31 46 49 12 11 48) (129 1 37) simpleGrading (0.3330513 1 0.616522811)	//c2r

    hex (10 72 71 9  33 74 73 34) (199 1 75) simpleGrading (10.03846 1 2.18318)		//d1laa
    hex (72 49 48 71 74 51 50 73) (79 1 75) simpleGrading (1 1 2.18318)			//d1lbb

    hex (33 74 73 34 14 76 75 13) (199 1 75) simpleGrading (10.03846 1 0.458047435)	//d2laa
    hex (74 51 50 73 76 53 52 75) (79 1 75) simpleGrading (1 1 0.458047435)		//d2lbb

    hex (49 12 11 48 51 36 35 50) (129 1 75) simpleGrading (0.3330513 1 2.18318)	//d1r

    hex (51 36 35 50 53 16 15 52) (129 1 75) simpleGrading (0.33330513 1 0.458047435)	//d2r

    hex (12 78 77 11 36 80 79 35) (92 1 75) simpleGrading (3.02538 1 2.18318)		//e1laa
    hex (78 55 54 77 80 57 56 79) (56 1 75) simpleGrading (1 1 2.18318)		//e1lbb

    hex (55 18 17 54 57 38 37 56) (92 1 75) simpleGrading (0.33053699 1 2.18318)		//e1r

    hex (36 80 79 35 16 82 81 15) (92 1 75) simpleGrading (3.02538 1 0.458047435)	//e2laa
    hex (80 57 56 79 82 59 58 81) (56 1 75) simpleGrading (1 1 0.458047435)	//e2lbb

    hex (57 38 37 56 59 20 19 58) (92 1 75) simpleGrading (0.33053699 1 0.458047435)	//e2r
    hex (18 22 21 17 38 40 39 37) (41 1 75) simpleGrading (1 1 2.18318)		//f1
    hex (38 40 39 37 20 24 23 19) (41 1 75) simpleGrading (1 1 0.458047435)	//f2
    hex (22 61 60 21 40 63 62 39) (46 1 75) simpleGrading (10.186 1 2.18318)		//g1l
    hex (61 26 25 60 63 42 41 62) (20 1 75) simpleGrading (1 1 2.18318)		//g1r
    hex (40 63 62 39 24 65 64 23) (46 1 75) simpleGrading (10.186 1 0.458047435)	//g2l
    hex (63 42 41 62 65 28 27 64) (20 1 75) simpleGrading (1 1 0.458047435)	//g2r
);

edges           
(
);

patches         
(
	patch
	INLET 
	(
		(0 2 1 0)
	)

	patch
	OUTLET
	(
		(20 24 23 19)
	)

	wedge
	axi_symm-r
	(
		(0 3 5 2)	//a

		(3  66 68  5)	//blaa
		(66 43 45 68)	//blbb

		(43 6 8 45)	//br

		(5 68 70 29)	//c1laa
		(68 45 47 70)	//c1lbb

		(45  8 32 47)	//c1r

		(29 70 72 10)	//c2laa
		(70 47 49 72)	//c2lbb

		(47 32 12 49)	//c2r

		(10 72 74 33)	//d1laa
		(72 49 51 74)	//d1lbb

		(49 12 36 51)	//d1r

		(33 74 76 14)	//d2laa
		(74 51 53 76)	//d2lbb

		(51 36 16 53)	//d2r

		(12 78 80 36)	//e1laa
		(78 55 57 80)	//e1lbb

		(55 18 38 57)	//e1r

		(36 80 82 16)	//e2laa
		(80 57 59 82)	//e2lbb


		(57 38 20 59)	//e2r

		(18 22 40 38)	//f1
		(38 40 24 20)	//f2

		(22 61 63 40)	//g1l
		(61 26 42 63)	//g1r

		(40 63 65 24)	//g2l
		(63 42 28 65)	//g2r
	)

	wedge
	axi_symm-f
	(
		(0 3 4 1)	//a

		(3 66 67 4)	//blaa
		(66 43 44 67)	//blbb


		(43 6 7 44)	//br

		(4  67 69 30)	//c1laa
		(67 44 46 69)	//c1lbb

		(44 7  31 46)	//c1r

		(30 69 71  9)	//c2laa
		(69 46 48 71)	//c2lbb

		(46 31 11 48)	//c2r

		(9  71 73 34)	//d1laa
		(71 48 50 73)	//d1lbb

		(48 11 35 50)	//d1r

		(34 73 75 13)	//d2laa
		(73 50 52 75)	//d2lbb

		(50 35 15 52)	//d2r

		(11 77 79 35)	//e1laa
		(77 54 56 79)	//e1lbb

		(54 17 37 56)	//e1r

		(35 79 81 15)	//e2laa
		(79 56 58 81)	//e2lbb

		(56 37 19 58)	//e2r

		(17 21 39 37)	//f1
		(37 39 23 19)	//f2

		(21 60 62 39)	//g1l
		(60 25 41 62)	//g1r

		(39 62 64 23)	//g2l
		(62 41 27 64)	//g2r
	)
	
	wall
	NWALL
	(
	        (2 5 4 1)	//a
	)
	
	wall
	WALL
	(
		(5 29 30 4)	//c1l
		(29 10 9 30)	//c2l
		(10 33 34 9)	//d1l
		(33 14 13 34)	//d2l
		(14 76 75 13)	//d2l_topaa
		(76 53 52 75)	//d2l_topbb
		(53 16 15 52)	//d2r_top
		(16 82 81 15)	//e2laa
		(82 59 58 81)	//e2lbb

		(59 20 19 58)	//e2r
                (24 65 64 23)	//g2l
                (65 28 27 64)	//g2r
		(26 42 41 25)	//g1r
		(42 28 27 41)	//g2r
	)

	wall
	DEPOSITOR
	(
		(6 8 7 6)	//br
		(8 32 31 7)	//c1r
		(32 12 11 31)	//c2r
                (12 78 77 11)	//e1laa
                (78 55 54 77)	//e1lbb

                (55 18 17 54)	//e1r
                (18 22 21 17)	//f1
                (22 61 60 21)	//g1l
                (61 26 25 60)	//g1r
	)
);

mergePatchPairs
(
);

// ************************************************************************* //
