PlasmaExpansion/OpenFOAM-3.0.0/100PaOutlet/system/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

pressureBound
{
    type            limitScalarField;
    active          yes;

    limitScalarFieldCoeffs
    {
        selectionMode   all;
        fieldName       p;
        minFieldValue   2.0;
        scaleCoeff      0.9;
    }
}




// ************************************************************************* //
